mg-emacs.org
** The ~mg-emacs-exwm.el~ module
:PROPERTIES:
:ID:       f027d45b-3a55-450b-8d24-98e3a9530809
:END:

I use EXWM as X window manager on every Linux machine I own. I started using it ~ [2023-10-07 Sat] and never went back since then. The reason that moved me in adopting it is somehow trivial: I know Emacs, I know its keybindings, and I know how to tweak it. Having other tiling window manages, such as i3, bspwn, and the like, forces you to learn new, inconsistent and sometimes complex languages to configure them.

To give you an example, I tried AwesomeWM for a while. I was quite happy with it and I really enjoyed some of its minimalistic features and good flexibility. However, I was quite unhappy with Lua and I felt I was not really mastering the language the way I wanted to. Therefore, switching to an environment and language I knew was indeed a reasonable choice.

EXWM just works. There are no additional requirements needed, just Emacs and a couple of third-party tools for the system tray. Besides that, nothing else. This is exactly what I look for when adopting a new tool.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-exwm.el"
  (when (and (display-graphic-p) (not (eq system-type 'darwin)))
    (defun mg-exwm-update-class ()
      (exwm-workspace-rename-buffer exwm-class-name))
    (use-package exwm
      :straight t
      :config

      ;; Custom tools and applications that I use
      (defconst mg-browser "/usr/bin/firefox")
      (defconst mg-keyboard-layout-changer "/usr/bin/setxkbmap")

      ;; Custom application started that leverages on `xstarter'
      (defun mg-starter ()
        "Choose the application to run from a list generated with
  `xstarter', which is, then, a prerequisite for this function to
  work."
        (interactive)
        (let* ((candidates (split-string
  			  (shell-command-to-string "xstarter -P")
  			  "\n"
  			  t))
  	     (application-path (completing-read
  				"Application to launch: "
  				candidates)))
  	(start-process "" nil application-path)))

      (setq exwm-workspace-number 6)
      (add-hook 'exwm-update-class-hook #'mg-exwm-update-class)
      (require 'exwm-randr)
      (exwm-randr-enable)
      (setq exwm-input-prefix-keys
  	  '(?\C-x
  	    ?\C-u
  	    ?\C-n
  	    ?\C-t
  	    ?\C-h
  	    ?\C-p
  	    ?\C-g
  	    ?\M-x
  	    ?\M-`
  	    ?\M-&
  	    ?\M-:
  	    ?\C-\M-j
  	    ?\C-\ ))
      (setq exwm-input-simulation-keys
  	  '(([?\C-b] . [left])
  	    ([?\C-f] . [right])
  	    ([?\C-p] . [up])
  	    ([?\C-n] . [down])
  	    ([?\C-a] . [home])
  	    ([?\C-e] . [end])
  	    ([?\M-v] . [prior])
  	    ([?\C-v] . [next])
  	    ([?\C-d] . [delete])
  	    ([?\C-k] . [S-end delete])))
      (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)
      (setq exwm-layout-show-all-buffers t)
      (setq exwm-workspace-show-all-buffers t)
      (exwm-input-set-key
       (kbd "<XF86MonBrightnessUp>")
       (lambda ()
         (interactive)
         (start-process-shell-command
  	"light" nil "light -A 10")))
      (exwm-input-set-key
       (kbd "<XF86MonBrightnessDown>")
       (lambda ()
         (interactive)
         (start-process-shell-command
  	"light" nil "light -U 10")))
      (setq exwm-input-global-keys
  	  `(
  	    ([?\s-r] . exwm-reset)
  	    ([?\s-k]
  	     . delete-window)
  	    ([s-left] . windmove-left)
  	    ([s-right] . windmove-right)
  	    ([s-up] . windmove-up)
  	    ([s-down] . windmove-down)
  	    ([?\s-m] . exwm-workspace-move-window)
  	    ([?\s-\ ] .
  	     (lambda ()
  	       (interactive)
  	       (mg-starter)))
  	    ([?\s-w] . exwm-workspace-switch)
  	    ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))
  	    ([?\s-b] .
  	     (lambda ()
  	       (interactive)
  	       (start-process "" nil mg-browser)))
  	    ([?\s-i] .
  	     (lambda ()
  	       (interactive)
  	       (start-process "" nil mg-keyboard-layout-changer "it")))
  	    ([?\s-u] .
  	     (lambda ()
  	       (interactive)
  	       (start-process "" nil mg-keyboard-layout-changer "us")))
  	    ([?\s-f] .
  	     (lambda ()
  	       (interactive)
  	       (mg-check-and-toggle-deepwork-mode)))))
      (setq exwm-workspace-index-map 
  	  (lambda (index) (number-to-string (1+ index))))
      (add-hook 'exwm-init-hook
  	      (lambda ()
  		(progn
  		  (start-process "dbus-update-activation-environment" nil "dbus-update-activation-environment" "DISPLAY")
  		  (when (not (equal (system-name) mg-work-laptop-hostname))
  		    (start-process "x-on-resize" nil "x-on-resize" "-c /home/claudio/Repositories/knock-files/cli-utils/monitor_hotplug.sh"))) t)))

    (use-package desktop-environment
      :straight t
      :after (exwm)
      :config
      (exwm-input-set-key (kbd "<XF86AudioRaiseVolume>") #'desktop-environment-volume-increment)
      (exwm-input-set-key (kbd "<XF86AudioLowerVolume>") #'desktop-environment-volume-decrement)
      (exwm-input-set-key (kbd "<XF86AudioMute>") #'desktop-environment-toggle-mute)
      (exwm-input-set-key (kbd "s-l") #'desktop-environment-lock-screen)
      (exwm-input-set-key (kbd "<XF86AudioPlay>") #'desktop-environment-toggle-music)
      (exwm-input-set-key (kbd "<XF86AudioPause>") #'desktop-environment-toggle-music)
      (exwm-input-set-key (kbd "<XF86AudioNext>") #'desktop-environment-music-next)
      (exwm-input-set-key (kbd "s-s") #'desktop-environment-screenshot-part)
      :custom
      (desktop-environment-volume-get-command "pamixer --get-volume")
      (desktop-environment-volume-set-command "pamixer %s")
      (desktop-environment-volume-toggle-regexp nil)
      (desktop-environment-volume-get-regexp "\\([0-9]+\\)")
      (desktop-environment-volume-normal-increment "-i 5 --allow-boost")
      (desktop-environment-volume-normal-decrement "-d 5")
      (desktop-environment-volume-toggle-command "pamixer -t")
      (desktop-environment-screenlock-command "xsecurelock"))

    (use-package time
      :straight t
      :after (exwm)
      :custom
      (display-time-format "[%d/%b %H:%M]")
      :config
      (display-time-mode)
      (display-battery-mode))

    (use-package mg-exwm
      :ensure nil
      :bind (("C-c u w l z" . mg-exwm-trigger-zurich-layout)
  	   ("C-c u w l d" . mg-exwm-trigger-default-layout)
  	   ("C-c u w l w" . mg-exwm-trigger-workstation-layout))))

  (provide 'mg-emacs-exwm)
#+end_src

** The ~mg-emacs-themes.el~ module

I typically prefer simple and highly legible themes. Back in the days, I used to change theme quite often. The theme I've been enjoying the most is likely [[https://github.com/bbatsov/zenburn-emacs][Zenburn]], because it is also the one I used for the longest period of time without switching to any other theme. After some time though, I switched to ~modus-vivendi~, because of its simplicity and legibility. I'm finding it better than the one I was using before, and I think I'll stick with it for years to come. However, the Emacs standard theme is even more legible and plain, so it should be worth trying it.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-themes.el"
  (defun mg-init-macos-theme ()
    "Enable the theme environment of choice for darwin."
    (set-frame-font "Liberation Mono 17" nil t)
    (use-package standard-themes :straight t :config
      (load-theme 'standard-dark t)))

  (defun mg-init-linux-theme ()
    "Enable the theme enviroment of choice for linux."
    (set-frame-font "Iosevka Comfy 14" nil t)
    (use-package ef-themes :straight t :config
      (load-theme 'ef-autumn t)))

  (if (display-graphic-p)
      (progn
        (if (equal system-type 'darwin)
  	  (mg-init-macos-theme)
  	(mg-init-linux-theme))
        (set-fringe-mode 0))
    (set-face-background 'default "undefined"))
#+end_src

The following piece of code introduces ~hide-mode-line~ mode, which is used in a custom function of mine to enable PDF presentation mode (not technically an Emacs mode, rather a custom layout).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-themes.el"
  (use-package hide-mode-line
    :straight t)

  (provide 'mg-emacs-themes)
#+end_src

The only other feature that needs some clarification for the above code is the conditional statement on the ~display-graphic-p~. When not on the GUI version of Emacs (i.e., from CLI), I prefer not to select any theme and just stick with the one used in the terminal emulator. I find this way to go way less confusing, and surely lowers cognitive overhead for me.

** The ~mg-emacs-layouts.el~ module
:PROPERTIES:
:ID:       3B58B914-77A7-4942-A229-1A639C6B9287
:END:

In this module I enable some other packages I use to visually customize buffers and text within Emacs. For instance, I use ~olivetti~ and ~logos~ in conjunction for conveniently display text to avoid distractions. This comes into play when I need to write huge wall of texts without switching back and forth to code listings (moving from a full-width piece of code to the ~olivetti-logos~ layout is indeed confusing to me, and raises cognitive overload).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-layouts.el"
  (use-package olivetti
    :straight t)

  (use-package logos
    :bind (("C-c p f" . logos-focus-mode))
    :straight t
    :custom
    (logos-outlines-are-pages t)
    :config
    (setq-default logos-hide-cursor nil
  		logos-hide-mode-line t
  		logos-hide-header-line t
  		logos-hide-buffer-boundaries t
  		logos-hide-fringe t
  		logos-variable-pitch nil
  		logos-buffer-read-only nil
  		logos-scroll-lock nil
  		logos-olivetti t)
    (let ((map global-map))
      (define-key map [remap narrow-to-region] #'logos-narrow-dwim)
      (define-key map [remap forward-page] #'logos-forward-page-dwim)
      (define-key map [remap backward-page] #'logos-backward-page-dwim)))

  (provide 'mg-emacs-layouts)
#+end_src

