mg-emacs.org
** The ~mg-notmuch.el~ library

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-notmuch.el"
  ;;; mg-notmuch.el --- Custom functions for `notmuch' -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.com/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.4"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This library introduces a series of custom function I use for the
  ;; `notmuch' e-mail client for Emacs.

  ;;; Code:

  (defconst mg-notmuch--get-emails "mbsync -a"
    "Shell command used to get new emails.")

  (defconst mg-notmuch--reindex "notmuch new"
    "Shell command used to reindex notmuch.")

  (defconst mg-notmuch--update-shell-commands
    (list mg-notmuch--get-emails mg-notmuch--reindex
  	"Shell commands used to update the mail directory.
  NOTE: The order of these commands *matter*. Do not change it."))

  (defun mg-notmuch-update-mail ()
    "Update the mail directory."
    (interactive)
    (dolist (cmd mg-notmuch--update-shell-commands)
      (call-process-shell-command cmd nil 0)))

  (provide 'mg-notmuch)

  ;;; mg-notmuch.el ends here
#+end_src

** The ~mg-pkm-utils.el~ library

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-pkm-utils.el"
  ;;; mg-pkm-utils.el --- Utility functions for my pkm -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.org/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.4"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This library introduces several utility functions and commands to
  ;; manage my "Personal Knowledge Management System". Although the
  ;; system heavily relies on `org-mode' and `denote', functions in this
  ;; library tackle general purpose use-cases (i.e., not necessarily
  ;; related to `org-mode' or `denote').

  ;;; Code:

  (require 'mg-org)

  (defun mg-org-compute-deep-work-minutes (start-date end-date)
    "Compute the minutes of deep work from START-DATE to END-DATE.

    This function searches into both projects and archive files to
    retrive logbooks properties and their related timing."
    (interactive
     (list
      (format "<%s>" (org-read-date))
      (format "<%s>" (org-read-date))))
    (let* ((default-directory (denote-directory))
  	 (target-files
  	  '(mg-work-projects-file
  	    mg-archive-file)))
      (insert (format "%s"
  		    (apply '+ (mapcar (lambda (file)
  					(mg-org-get-clock-minutes file start-date end-date)) target-files))))))

  (defun mg-toggle-pdf-presentation-mode ()
    "Toggle a presentation mode to show PDFs in a clean layout.

  When showing a PDF in docview, the modeline should be hidden, and the document itself should be centered, for better visibility."
    (interactive)
    (toggle-frame-fullscreen)
    (if (not (bound-and-true-p hide-mode-line-mode))
        (hide-mode-line-mode 1)
      (hide-mode-line-mode 0))
    (pdf-view-fit-page-to-window))

  (provide 'mg-pkm-utils)
  ;;; mg-pkm-utils.el ends here
#+end_src

** The ~mg-denote.el~ library
:PROPERTIES:
:ID:       cf17aa34-cd6c-4eea-be80-c111b00f5f3e
:END:

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-denote.el"
  ;;; mg-denote.el --- Custom code to extend denote -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.org/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.3"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This library introduces some custom Emacs Lisp code to extend the
  ;; functionalities provided by `denote'. Along with `org', `denote' is
  ;; probably one of the packages that I use (and tweak) the most within
  ;; Emacs.

  ;;; Code:

  (defun mg-denote-copy-timestamp-to-killring ()
    "Helper function to get a convenient denote-style timestamp."
    (interactive)
    (kill-new (denote-get-identifier)))

  (defun mg-denote--get-item (filter-regex)
    "Get a file path interactively starting from the denote-directory."
    (let* ((candidates (denote-directory-files filter-regex))
  	 (file-name (completing-read
  		     "Choose FILE: "
  		     candidates))
  	 (file-path file-name))
      file-path))

  (defun mg-denote--get-file ()
    "Get a denote file interactively starting from the denote-directory"
    (mg-denote--get-item denote-id-regexp))

  (defun mg-denote-find-file ()
    "Find files interactively starting from the denote-directory."
    (interactive)
    (find-file (mg-denote--get-file)))

  (defun mg-denote--get-zettel ()
    "Get zettel interactively starting from the denote directory."
    (mg-denote--get-item denote-signature-regexp))

  (defun mg-denote-find-zettel ()
    "Find zettels interactively starting from the denote-directory."
    (interactive)
    (find-file (mg-denote--get-zettel)))

  (defun mg-insert-denote-or-normal-link (name)
    "Insert a denote link if the file specified by buffer-name is a denote item, otherwise a normal link."
    (if (denote-file-is-note-p (format "%s" name))
        (mg-denote--insert-link-from-file-path name)
      (format "[[file:%s]]" name)))

  (defun mg-denote--insert-link-from-file-path (file-path)
    "Insert a denote link provided a file path"
    (let ((file-description (denote--link-get-description file-path)))
      (denote-link file-path (denote-filetype-heuristics file-path) file-description)))

  (defun mg-denote-insert-zettel-link ()
    "Select a zettel from `denote-directory` and insert its link at current point."
    (interactive)
    (let ((file-path
  	 (mg-denote--get-zettel)))
      (mg-denote--insert-link-from-file-path file-path)))

  (defun mg-denote-grep-on-zettels ()
    "Grep for a search query, but only on zettels."
    (interactive)
    (let ((zettels
  	 (denote-directory-files denote-signature-regexp)))
      (consult-grep zettels)))

  (defun mg-denote-get-references-in-dired ()
      "Get the reference notes from the `denote-directory' listed in `dired'.
  Although this functionality is not only related to `denote', rather on 'dired', it's still relevant in this library: all notes I have are `denote' entries."
      (interactive)
      (dired (denote-directory))
      (revert-buffer)
      (dired-mark-files-regexp "_bib")
      (dired-toggle-marks)
      (dired-do-kill-lines)
      ;; NOTE: We don't want zettels to appear, this function just shows
      ;; reference entries
      (dired-mark-files-regexp denote-signature-regexp)
      (dired-do-kill-lines))

  ;;; mg-denote.el ends here
#+end_src

** The ~mg-kernel.el~ library

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-kernel.el"
  ;;; mg-kernel.el --- Utilities to use with the Linux kernel -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.com/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.4"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This is a series of utility functions I use when working with the
  ;; Linux kernel. All of my activities lie into Emacs, and I really
  ;; enjoy writing Emacs Lisp code. Therefore, some of these function
  ;; could also be easily implemented as simple bash scripts. Writing
  ;; them in Lisp is merely a convenience for me working with Emacs
  ;; every day.

  ;;; Code:
  (defun mg-kernel-coding-style/c-lineup-arglist-tabs-only (ignored)
    "Line up argument lists by tabs, not spaces."
    (let* ((anchor (c-langelem-pos c-syntactic-element))
  	 (column (c-langelem-2nd-pos c-syntactic-element))
  	 (offset (- (1+ column) anchor))
  	 (steps (floor offset c-basic-offset)))
      (* (max steps 1)
         c-basic-offset)))

  (add-hook 'c-mode-common-hook
  	  (lambda ()
  	    (c-add-style "linux-kernel"
  			 '("linux" (c-offsets-alist
  				    (arglist-cont-nonempty
  				     c-lineup-gcc-asm-reg
  				     linux-kernel-coding-style/c-lineup-arglist-tabs-only))))))

  (defun mg-kernel-coding-style/setup ()
    (let ((filename (buffer-file-name)))
      ;; Enable kernel mode for the appropriate files
      (when (and buffer-file-name
                 ( or (string-match "linux" buffer-file-name)
                   (string-match "liburing" buffer-file-name)))
        ;; (string-match "xfstests" buffer-file-name)))
        (setq indent-tabs-mode t)
        (setq tab-width 8)
        (setq c-basic-offset 8)
        (c-set-style "linux"))))

  (add-hook 'c-mode-hook 'mg-kernel-coding-style/setup)

  (defun mg-get-kernel-version-from-source (source)
    "Return the kernel version from the source SOURCE.

  When interactive, prompt the user for a kernel source. NOTE: This
  function has a double check at the end, to be relatively sure
  that a proper kernel version is returned to the user. This makes
  sense because sometimes for a, e.g., mispell, the user provides a
  wrong directory as SOURCE. The check could've been performed
  better, but for now it just proved to work."
    (interactive
     (list
      (read-file-name "Kernel SOURCE: ")))
    (let* ((command (format "cd %s && make kernelversion" source))
  	 (kernel-version
  	  (shell-command-to-string command)))
      (if (string-match-p "\\<[0-9]+\\." kernel-version)
  	(message "Kernel version for specificed SOURCE is %s" kernel-version)
        (user-error "Can't identify a kernel version for the specified SOURCE %s" source))))

  ;;; mg-kernel.el ends here
#+end_src

* Footnotes

[fn:1] I don't know whether it is mandatory in this case, and I've never tried to disable it. It is more efficient to have it running as a single instance anyhow, so that's why I'm doing it.
